Revit 2027 API
ParameterTypeId.RbsDuctTypeParam Property
 "Duct Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsDuctTypeParam { get; }
Public Shared ReadOnly Property RbsDuctTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsDuctTypeParam {
	ForgeTypeId^ get ();
}
static member RbsDuctTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace